---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalService.SingleServerService
source: html/40944f19-31c8-8b2f-0a3b-4dde91cfa413.htm
---
# SingleServerService Methods

Registers a server with its service.